{
  "copypastas": [
    "Glad to see all new gen unit is op balter solo op, wata solo op, cw solo op, lamia solo op, qu solo op, luna solo op, hanying solo op, wanshi solo op, lucia solo op, nanami solo op",
    "Yeah no \nPeople litteraly tested multiple times and Crimson Weave is litteraly the most busted frame in the game that completely ignore gameplay rotation\n\nShes the only one who can solo Legend Warzone CONSISTENTLY HIGH SCORING\n\nNot even Bianca and the supposedly *Worst* S Rank Hyperreal is as dumb as Crimsonweave\n\nWhy are people skipping Lee when No 21 is litteraly\nuseless with Alpha",
    "You SHOULD aim to get sss+ crimson weave as f2p. Crimson Weave stands out among Gen 2 units by having the highest percentage damage for her signature move compared to others in the same generation. Her SS3 skill is a game-changer, significantly boosting her overall damage. The impact is so substantial that it triples her damage output. Equipping her with a 2-piece Cottie Memory set enables an instant trigger of her signature move. This setup enhances her damage potential and allows for strategic use of her powerful moves. Crimson Weave is recognized as the best DPS unit among other Gen 2 attacker class units. Her exceptional damage output is not limited to a specific element. Crimson Weave's high damage allows her to score impressively in other elemental warzone stages as well as in PPC, showcasing her versatility and effectiveness across different scenarios.",
    "Why people interested in these low investment malding? Without core mechs? No sword slash kills, no triple sword dance bug, no insta ult sp delay, and no competition with real people who knows how to play. If you are good then make her SSS3 and play against real players in 1%/legend, not against 2 week newbees who don't know qte exists.",
    "You have a past history of being peanut gallery for people asking questions, have been called the misinformation mod before, and you're clearly being peanut gallery again saying your brain hurts twice out of nowhere just because I don't understand how to efficiently burn vouchers. I will say it again, I do not care that you're a mod, go back to general. I will happily bring you up to an admin if you want to escalate.",
    "How many hours of my life have I wasted playing this fucking piece of shit god damn game? Just so I can get highscores and feel good about myself. It's a fk joke. That's the only reason people mald WZ, really. Just so they can get a highscore- Cause like no one who malds WZ is a fk millionaire, you know, fk hot bitches and doing actually important things in life. Everyone who malds WZ is a degenerate, and getting highscores is the only way people can feel good about themselves. Like how many hours of my fk life have I wasted doing that bullshit? It's so stupid. It's fk pathetic. All I fk do is waste my life away trying to get highscores for a temporary god damn high, which'll last, fucking half a week, till it goes away, and Jam exposes me for the lowbie shitter I am. fk hell dude. It's a complete joke. Malding WZ is the most degenerate act man has ever come up with.",
    "Leaped Rozen outperforms Luna completely in terms of Core Passive (Vera's new Core Passive is as strong as SS Luna's Core Passive, but unlike Luna with her 4-5 Core attacks, Leaped Vera can do 7-8 Core attacks. Also Vera's new Core Passive has auto dodge) but her new 2 ult still does less damage than Luna's ult for obvious reasons.\n\nYeah, Rozen is no longer a QTE slave, she's extremely good burster who can be on par with Luna now lol.",
    "Bad test. Astral S+ is ALWAYS better than Luna SS and is on par with Luna SSS. Solo camu SSS is better than both, team Camu with Max investment SSS/SSS+ is on par or better than Luna SSS depending on mission type (Battlefield she catches up waves 4-6 then lags behind final wave because Camu gets there faster and has his sig up by the time the boss is there and nukes it) and then much worse in Paincage because of obvious reasons.\n\nAstral competes. You swapped to Vera who is always a net dps loss, you should never be swapping to Vera unless it's to proc a set bonus or use ONE 3 ping/sig and then swap off again. She is always a dps loss otherwise.\n\nAlso your individual skill is leaving a TON to be desired, how are you getting hit by CAMU of all the paincage bosses. He sucks. You also keep missing your skills. Bruh. At least use a GOOD attempt to showcase your claim.\n\nAnyways, CN and JP have done this already and Astral has been consistently better than SS Luna and similar to SSS Luna when they are same investment",
    "Hey, just wanted to say CONGRATULATIONS (Babel was harder pre Nier) on the MAX BABEL (Babel was harder in pre Nier) RETAIN. I know you've been working really hard (Babel was harder) at it, and I'm happy that you've (used Nier and stage buffs) achieved your goal of completion. I know your journey through (Babel was harder) the content was filled with ups and downs, but you and (Babel was harder) your teams stuck (Babel was harder) together through them all, and you were rewarded for your patience and (the Nier won't be shilled next year) tenacity. Congratulations (Nier is shilled right now) once again, and here's to more success in your future (Babel used to be harder) endeavors!!!",
    "I'm skipping Luna for Blue Rose or 2B, the life of a f2p player is tough :pensive:",
    "I can't take it anymore. I'm sick of crimson weave. I try to play veritas. My crimson weave deals more damage. I try to play stigmata. My off-element crimson weave deals more damage. I try to play shukra. My off-element crimson weave deals more damage. I want to play feral scent. Her best team has crimson weave. I want to play garnet, lux. They both want crimson weave.\nShe grabs me by the throat. I pull for her. I cook for her. I give her her sig. She isn't satisfied. She tells me. *Give me more field time.* She grabs feral scent and forces her to throw herself off enemies. \"You just need to deal more damage. I can deal more damage than garnet\"\nI can't pull for her  sig, I don't have enough bc. She grabs my credit card. It declines. \"Guess this is the end.\" She grabs 21. She says \"uoogghh\" There is no hint of sadness in her eyes. Nothing but pure, hate towards every other unit. What a cruel world.",
    "Guys is pgr a good game?\nI seen some art of a weird looking dude spinning his sword while saying some stupid stuff and honestly he looked like a clown but then i seen this girl who had a bit of blue hair and omg guys her feet are so hot like i want her to step on me with those toes so bad",
    "I skipped Hyperreal and Stigmata for SSS CW.\nI am still not regretting because Lucia is the reason I started PGR anyway.\nShe is so strong that she allows me to clear any content easily.\nThe slight downside is less Paincage skulls and warzone rewards.\nBut as a monthlypass player (f2p when I got SSS 6* Lucia CW), I dont get many good characters to use those currencies on anyway.\n\nAnd yes, thank you for the clarification. I will go for SS3.\nSheesh why are you being angry for me? Don't get your dedication man",
    "The reason you should skip lamia is because Black Rock Shooter is coming next patch, so lamia's patch should be used as a saving patch. As you all know we only get one shot at pulling black rock shooter and her sig weapon, BRS out damages lamia at SSS, Brs is just essential for fire team and the upcoming Watanabe epitaph, pulling for lamia is unwise and is a bad move.",
    "Who do you honestly think you are threatening 😡, i and everyone have the right to free speech. I'm not wrong for recommending people to pull an extremely limited charecter. People will severly regret not investing in this charecter. Meta can go to hell, this is about paying respect to a literally dead franchise and an iconically well designed charecter. Getting one copy and keeping the charecter shelved isn't respect. Watanabe can be pulled for anytime.",
    "(1) The first reason you should skip lamia is because Black Rock Shooter is coming next patch, so lamia's patch should be used as a saving patch. As you all know we only get one shot at pulling black rock shooter and her sig weapon, BRS out damages lamia at SSS, Brs is just essential for fire team and the upcoming Watanabe epitaph, pulling for lamia is unwise and is a bad move.\n\n(2) Snow petal coating for baltar is getting another rerun during the black rock shooter , so that means if you want the snow petal coating, you only have one more chance to get it until 2027 when it most likely reruns again.\n\n(3) Stronger charecters like void luna and qu shukra who are premier DPS charecters that can make or break your account will be coming. You may ruin your account if you pull for lamia. Your account may be ruined\n\n(4) Lamia is the Weakest gen 2 attacker and has the worst damage output. Lee hyperreal is far stronger and far more superior than her and it is a known fact, so is alpha crimson weave and charecters such as Alisa echo. Even charecters such as camu out damage her\n\n(5) If you don't want to save, you can choose to gain extra copies of the charecters you have such as Liv empyrea who are critical charecters that offer support. Lamia is just unnecessary.\n\nFeel free to add your take in the comments. I needed to make this post because they are scammer's in the community who will tell you to pull for certain charecters when those same charecters are useless, this I call them meta scammer's. Honestly speaking lamia brings no real benefit to the table. You are just better off pulling more copies of alpha and Selena capprechio or lee hyperreal who genuinely brings more value",
    "Leaped Rozen outperforms Luna completely in terms of Core Passive (Vera's new Core Passive is as strong as SS Luna's Core Passive, but unlike Luna with her 4-5 Core attacks, Leaped Vera can do 7-8 Core attacks. Also Vera's new Core Passive has auto dodge) but her new 2 ult still does less damage than Luna's ult for obvious reasons.\n\nYeah, Rozen is no longer a QTE slave, she's extremely good burster who can be on par with Luna now lol.",
    "It is just a complain. It is rogue activity, but you need to do a different place to earn random buff. That means one need to do 20min game thousands of time in order to get the buff you need. By the way, the buffs pool is really small. Just add base or element attack, increase recovery, enhance change speed and increase certain character,s skill. So, while there is no funny random here, just another silly farming process. Also, the monsters in this farm area has really high attack, so one need to focus one attention in order not to die suddenly. What's more, since it put some strong elite monster in the farm area, when I want to kill them first, the stupid targeting system always target the farthest one. Besides, it put lots of strong boss in the farm, those who willing jump everywhere with a time limit, so half the time, I just waist 20min earn nothing. I just want to ask. Is there any reason to make farm so hard. In addition, each character can enhance just use those buff. And to pass a stage, one need to enhance 15 characters, each need hundred buffs to reach stage's recommended level. So, in short, I guess I need to place it at least 3 hr a day in order to reach their need. Are you insane!"
  ]
}
