{
  "copypastas": [
    "Glad to see all new gen unit is op balter solo op, wata solo op, cw solo op, lamia solo op, qu solo op, luna solo op, hanying solo op, wanshi solo op, lucia solo op, nanami solo op",
    "Yeah no \nPeople litteraly tested multiple times and Crimson Weave is litteraly the most busted frame in the game that completely ignore gameplay rotation\n\nShes the only one who can solo Legend Warzone CONSISTENTLY HIGH SCORING\n\nNot even Bianca and the supposedly *Worst* S Rank Hyperreal is as dumb as Crimsonweave\n\nWhy are people skipping Lee when No 21 is litteraly\nuseless with Alpha",
    "You SHOULD aim to get sss+ crimson weave as f2p. Crimson Weave stands out among Gen 2 units by having the highest percentage damage for her signature move compared to others in the same generation. Her SS3 skill is a game-changer, significantly boosting her overall damage. The impact is so substantial that it triples her damage output. Equipping her with a 2-piece Cottie Memory set enables an instant trigger of her signature move. This setup enhances her damage potential and allows for strategic use of her powerful moves. Crimson Weave is recognized as the best DPS unit among other Gen 2 attacker class units. Her exceptional damage output is not limited to a specific element. Crimson Weave's high damage allows her to score impressively in other elemental warzone stages as well as in PPC, showcasing her versatility and effectiveness across different scenarios.",
    "Why people interested in these low investment malding? Without core mechs? No sword slash kills, no triple sword dance bug, no insta ult sp delay, and no competition with real people who knows how to play. If you are good then make her SSS3 and play against real players in 1%/legend, not against 2 week newbees who don't know qte exists.",
    "You have a past history of being peanut gallery for people asking questions, have been called the misinformation mod before, and you're clearly being peanut gallery again saying your brain hurts twice out of nowhere just because I don't understand how to efficiently burn vouchers. I will say it again, I do not care that you're a mod, go back to general. I will happily bring you up to an admin if you want to escalate.",
    "How many hours of my life have I wasted playing this fucking piece of shit god damn game? Just so I can get highscores and feel good about myself. It's a fk joke. That's the only reason people mald WZ, really. Just so they can get a highscore- Cause like no one who malds WZ is a fk millionaire, you know, fk hot bitches and doing actually important things in life. Everyone who malds WZ is a degenerate, and getting highscores is the only way people can feel good about themselves. Like how many hours of my fk life have I wasted doing that bullshit? It's so stupid. It's fk pathetic. All I fk do is waste my life away trying to get highscores for a temporary god damn high, which'll last, fucking half a week, till it goes away, and Jam exposes me for the lowbie shitter I am. fk hell dude. It's a complete joke. Malding WZ is the most degenerate act man has ever come up with.",
    "Leaped Rozen outperforms Luna completely in terms of Core Passive (Vera's new Core Passive is as strong as SS Luna's Core Passive, but unlike Luna with her 4-5 Core attacks, Leaped Vera can do 7-8 Core attacks. Also Vera's new Core Passive has auto dodge) but her new 2 ult still does less damage than Luna's ult for obvious reasons.\n\nYeah, Rozen is no longer a QTE slave, she's extremely good burster who can be on par with Luna now lol.",
    "Bad test. Astral S+ is ALWAYS better than Luna SS and is on par with Luna SSS. Solo camu SSS is better than both, team Camu with Max investment SSS/SSS+ is on par or better than Luna SSS depending on mission type (Battlefield she catches up waves 4-6 then lags behind final wave because Camu gets there faster and has his sig up by the time the boss is there and nukes it) and then much worse in Paincage because of obvious reasons.\n\nAstral competes. You swapped to Vera who is always a net dps loss, you should never be swapping to Vera unless it's to proc a set bonus or use ONE 3 ping/sig and then swap off again. She is always a dps loss otherwise.\n\nAlso your individual skill is leaving a TON to be desired, how are you getting hit by CAMU of all the paincage bosses. He sucks. You also keep missing your skills. Bruh. At least use a GOOD attempt to showcase your claim.\n\nAnyways, CN and JP have done this already and Astral has been consistently better than SS Luna and similar to SSS Luna when they are same investment",
    "Hey, just wanted to say CONGRATULATIONS (Babel was harder pre Nier) on the MAX BABEL (Babel was harder in pre Nier) RETAIN. I know you've been working really hard (Babel was harder) at it, and I'm happy that you've (used Nier and stage buffs) achieved your goal of completion. I know your journey through (Babel was harder) the content was filled with ups and downs, but you and (Babel was harder) your teams stuck (Babel was harder) together through them all, and you were rewarded for your patience and (the Nier won't be shilled next year) tenacity. Congratulations (Nier is shilled right now) once again, and here's to more success in your future (Babel used to be harder) endeavors!!!",
    "I'm skipping Luna for Blue Rose or 2B, the life of a f2p player is tough :pensive:",
    "I can't take it anymore. I'm sick of crimson weave. I try to play veritas. My crimson weave deals more damage. I try to play stigmata. My off-element crimson weave deals more damage. I try to play shukra. My off-element crimson weave deals more damage. I want to play feral scent. Her best team has crimson weave. I want to play garnet, lux. They both want crimson weave.\nShe grabs me by the throat. I pull for her. I cook for her. I give her her sig. She isn't satisfied. She tells me. *Give me more field time.* She grabs feral scent and forces her to throw herself off enemies. \"You just need to deal more damage. I can deal more damage than garnet\"\nI can't pull for her  sig, I don't have enough bc. She grabs my credit card. It declines. \"Guess this is the end.\" She grabs 21. She says \"uoogghh\" There is no hint of sadness in her eyes. Nothing but pure, hate towards every other unit. What a cruel world.",
    "Guys is pgr a good game?\nI seen some art of a weird looking dude spinning his sword while saying some stupid stuff and honestly he looked like a clown but then i seen this girl who had a bit of blue hair and omg guys her feet are so hot like i want her to step on me with those toes so bad",
    "I skipped Hyperreal and Stigmata for SSS CW.\nI am still not regretting because Lucia is the reason I started PGR anyway.\nShe is so strong that she allows me to clear any content easily.\nThe slight downside is less Paincage skulls and warzone rewards.\nBut as a monthlypass player (f2p when I got SSS 6* Lucia CW), I dont get many good characters to use those currencies on anyway.\n\nAnd yes, thank you for the clarification. I will go for SS3.\nSheesh why are you being angry for me? Don't get your dedication man",
    "The reason you should skip lamia is because Black Rock Shooter is coming next patch, so lamia's patch should be used as a saving patch. As you all know we only get one shot at pulling black rock shooter and her sig weapon, BRS out damages lamia at SSS, Brs is just essential for fire team and the upcoming Watanabe epitaph, pulling for lamia is unwise and is a bad move.",
    "Who do you honestly think you are threatening 😡, i and everyone have the right to free speech. I'm not wrong for recommending people to pull an extremely limited charecter. People will severly regret not investing in this charecter. Meta can go to hell, this is about paying respect to a literally dead franchise and an iconically well designed charecter. Getting one copy and keeping the charecter shelved isn't respect. Watanabe can be pulled for anytime.",
    "(1) The first reason you should skip lamia is because Black Rock Shooter is coming next patch, so lamia's patch should be used as a saving patch. As you all know we only get one shot at pulling black rock shooter and her sig weapon, BRS out damages lamia at SSS, Brs is just essential for fire team and the upcoming Watanabe epitaph, pulling for lamia is unwise and is a bad move.\n\n(2) Snow petal coating for baltar is getting another rerun during the black rock shooter , so that means if you want the snow petal coating, you only have one more chance to get it until 2027 when it most likely reruns again.\n\n(3) Stronger charecters like void luna and qu shukra who are premier DPS charecters that can make or break your account will be coming. You may ruin your account if you pull for lamia. Your account may be ruined\n\n(4) Lamia is the Weakest gen 2 attacker and has the worst damage output. Lee hyperreal is far stronger and far more superior than her and it is a known fact, so is alpha crimson weave and charecters such as Alisa echo. Even charecters such as camu out damage her\n\n(5) If you don't want to save, you can choose to gain extra copies of the charecters you have such as Liv empyrea who are critical charecters that offer support. Lamia is just unnecessary.\n\nFeel free to add your take in the comments. I needed to make this post because they are scammer's in the community who will tell you to pull for certain charecters when those same charecters are useless, this I call them meta scammer's. Honestly speaking lamia brings no real benefit to the table. You are just better off pulling more copies of alpha and Selena capprechio or lee hyperreal who genuinely brings more value",
    "Leaped Rozen outperforms Luna completely in terms of Core Passive (Vera's new Core Passive is as strong as SS Luna's Core Passive, but unlike Luna with her 4-5 Core attacks, Leaped Vera can do 7-8 Core attacks. Also Vera's new Core Passive has auto dodge) but her new 2 ult still does less damage than Luna's ult for obvious reasons.\n\nYeah, Rozen is no longer a QTE slave, she's extremely good burster who can be on par with Luna now lol.",
    "It is just a complain. It is rogue activity, but you need to do a different place to earn random buff. That means one need to do 20min game thousands of time in order to get the buff you need. By the way, the buffs pool is really small. Just add base or element attack, increase recovery, enhance change speed and increase certain character,s skill. So, while there is no funny random here, just another silly farming process. Also, the monsters in this farm area has really high attack, so one need to focus one attention in order not to die suddenly. What's more, since it put some strong elite monster in the farm area, when I want to kill them first, the stupid targeting system always target the farthest one. Besides, it put lots of strong boss in the farm, those who willing jump everywhere with a time limit, so half the time, I just waist 20min earn nothing. I just want to ask. Is there any reason to make farm so hard. In addition, each character can enhance just use those buff. And to pass a stage, one need to enhance 15 characters, each need hundred buffs to reach stage's recommended level. So, in short, I guess I need to place it at least 3 hr a day in order to reach their need. Are you insane!",
    "SS0 Nanami > SSS Alpha absolute disrespect is such a fun thing to see",
    "Daily reminder to pull for black rock shooter, because I'm living in a third world African country, and people are saying they will be no electricity for 15 days because of hydroelectric plant maintenance. Honestly hope kuro forgives me for not getting that Many rewards in lamia patch. I've been using a generator at school the entire day, only got a bit of play time on pgr, because of limited electricity. Forget about wantanabe, support a bro in a third world country and Double SSS+ black rock shooter. Don't be like those who didn't pull neir team, they are still crying even today and say that bianca stigmata is better, don't believe that propaganda.",
    "You are worthless bitch ass vergil fan, your life is literally is as valuable as a summer ant. I'm just gonna stomp you, you're gonna keep coming back. I'm gonna seal up all my cracks, you're gonna keep coming back. Why? because you keep smelling the syrup you worthless bitch ass vergil fan. You're gonna stay on my dick 'till you die. You serve no purpose in life. Your purpose in life is to ruin my babel runs sucking on my dick daily. Your purpose in life is to summon yourself and double team me, blowing a dick daily. Your life is NOTHING, you serve ZERO purpose. You should kill yourself NOW and give somebody else a max score on babel, so it can reflect on out medal. Because what are you here for? To worship me? KILL YOURSELF I mean that with a hundred percent with a thousand percent. I've never seen somebody SO worthless in my life, I'm deadass, I've never seen such a worthless enemy in my life, imagine if he had more than one clone. Oh my God. Like, imagine if somebody like that actually has more clones. I will feel so sorry everyone figting him 'cause the vergil fan literally serves no purpose. Imagine a vergil fan, now we got lots of clone first phase vergil fans and shit that run my runs daily on babel. this vergil fan is devoting the time he could be spending doing other shit, checking out a black man on babel and cucking  him relentlessly, it's crazy. I've never seen somebody so relentlessly to be seen, somebody's values SO worthless that they'll come into a fucking babel stage and keep coming in this bitch over, and over, and over, and over, and over, and over again and we keep killing you..",
    "How many black cards does it take to double SSS+ an S rank, i heard Ishmael (aka alien god  ) is coming to pgr. I want to go all out. I'm prepared to skip everyone before her her including alpha's OG coating",
    "This game was and still is super fun and engaging with the captivating story and insanely fun and fast combat. But this game is no longer supportive and accessible like it once was, and it shows.\n\nBefore, at maximum, units needed only SS to be functional, of which is obtainable for free. However, now, you are required to have signature weapon with at least one resonance + harmonization, maxed out SS cub, and in a lot of cases, SS3 or even SSS as well for certain voucherable units. The future introduction of affixes into the game only further exacerbates this problem , as well as the devs increasingly creating innate nerfs to new characters' core passives units in order to require SS3 more and more often, at a pace that most people cant keep up with.\n\nThis however, isn't even the end of it, because now with synchronization, your money, if you choose to spend, is now only a fraction of what it used to be. Synchronization, motivated by shallow reasoning from the “community,” (which is really a convenient excuse for them to find a way to save money for licensing costs for collabs,) aims to get global servers and other regions on the same schedule as China. However in doing so, they shortened patches to do this without proper compensation for spenders. They, now thanks to the new system, do not have discounted packs, battlepasses, or monthlies, nor do they get more for their cost; instead, they are solely given the option to buy multiple in bulk for the same previous unit price. Essentially, spenders, particular lower end ones with small budgets, now have to pay 2-3x as quickly to get THE SAME AMOUNT. UNBELIEVABLE! Where before, spending just Monthly A+BP was enough to sustain most people, everyone is left shafted, unless you are some millionaire heir with a trust fund.\n\nOverall, this game has fallen very fall from its promise to be an accommodating, affordable gacha game in the past 1.5 years, and I hope they can come back to their senses before it's too late.",
    "That's a you problem my guy, I've been F2P since day 1of global alumch of the game and didn't spend a single penny on the game, yet I still managed to get 3 SS maxed out characters (Lucia plume, Lucia Crimson abyss, and Liv Luminance)",
    "If you quit, you will severly weep when Virgil and dante come out, I'm sure you will want to find God after that. Don't quit, become free to play or chose to pay more and get Virgil and dante and nero when the collab comes. This game is called punishing gray raven, not pay gray raven and have an easy time. It's like playing dark souls with cheat engine, there's no fun in that honestly",
    "Oops sorry for spelling Virgil's name wrong, but what you fail to understand is that these collab charecters are hype. Anyone who misses out on them will truly cry when they miss the collab. Even as we speak they are people that cry bitterly knowing that they missed the neir collab, and they cope so hard and claim that bianca stigmata is better than 2b in physical. Imagine how much more they will cry when they scroll to Vergil but can't select him. Stop pretending, this will be the most talked about collab in gaming history. No one wants to miss out on gaming history",
    "That's 1 of the stupidest analogy I've ever heard. So who's the thief here? Kuro? And the house is the game? Are you saying you own the game? Stop playing instead of complaining at this point your just wasting your own time",
    "Ah....so Pyroath comes inside Nanami....Ishmael comes inside Lilith....Yatta doesn't come inside anyone....Jetavie comes inside Selena....? And the new Vera will come inside.....?",
    "Coming home from the hellish workplace by 6pm, back in the dorm, opening pgr is the first thing you did, done claiming the daily 30 bc and 100 bc from monthly, can't wait to call kurogames your daddy. Looking at that full 3s team that can't even have 5 weapon reso, you smiled and opened today's warzone, you ignored void zone which needs skill and immediately dipped into lightning zone right away. You're lucky that it's boss zone today, which can let your brain to not function much.\n\nFor the starter it'll definitely be crimson weave, you're using some useless swordwaves like a clown and feel that you're cool ass af. Finally, the rng gave you a set of blue 3pings, you 3pinged and hold dodge then got 250 passive stacks just like your IQ. You used garnet's qte, imagining you can do some cool ass double slams and enter the next rotation.\nWith your malfunctioning hand, you did a 126 stack holdge dodge slam, while you're looking at your iframe sliding through the mobs, it feels like you have set the soul of action game on fire, you feel like that's certain as the peak of katana master. After you repeatedly holding dodge and slam for 4 minutes, your warzone is over. You smiled when you're looking at your own 1.5m lightning zone score in leader bracket, when you someone above you with the same investment scored 3.2m, your single braincelled head is thinking is that guy using cheat/is that guy using some backdoor service, why can I only get such score with the same setup",
    "I think in the current situation in this game we can easily say pull what you want and it wouldnt be mistake imo. No way new players can pull every old meta units with sigs and cubs. Wz is free anyways, ppc.. who cares? Do 1550k score and call it a day. This game is a joke anyways. I think kuro wants pgr to be a waifu game, look at new bianca and her affix lol. She's both pyro and cw for poor people."
  ]
}
